IDEA StatiCa Open Model
IdeaConImportSettings.DesignCode Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets the Design Code There can be : ECEN AISC CISC RUS
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public string DesignCode { get; set; }
Public Property DesignCode As String
	Get
	Set
public:
property String^ DesignCode {
	String^ get ();
	void set (String^ value);
}
Property Value
Type: String
See Also
Reference
IdeaConImportSettings Class
IdeaRS.OpenModel.Connection Namespace